[IRI_ActiveCamo X2AbilityTemplate]
LocFriendlyName="Active Camo"
LocLongDescription="Unit equipped with a BIT remains concealed even when the squad is revealed."
LocHelpText="When the squad is revealed, this unit remains concealed."
LocFlyOverText="Active Camo"


[IRI_OrdnanceLauncher_CV X2GrenadeLauncherTemplate]
FriendlyName="Ordnance Launcher"
FriendlyNamePlural="Ordnance Launchers"
BriefSummary="An Ordnance Launcher allows our mechanized units to field a variety of explosive munitions."
TacticalText="<Bullet/> Ordnance Launcher is able to launch grenades with a substantially increased range relative to throwing.\n<Bullet/> Grants one Grenade-only slot."
AbilityDescName="ordnance launcher"

[IRI_OrdnanceLauncher_MG X2GrenadeLauncherTemplate]
FriendlyName="Ordnance Accelerator"
FriendlyNamePlural="Ordnance Accelerators"
BriefSummary="Ordnance Accelerator uses magnetic technology to propel explosive munitions further than our conventional launcher."
TacticalText="<Bullet/> Ordnance Accelerator is able to launch grenades with a substantially increased range relative to throwing.\n<Bullet/> Grants two Grenade-only slots."
AbilityDescName="ordnance launcher"

[IRI_OrdnanceLauncher_BM X2GrenadeLauncherTemplate]
FriendlyName="Ordnance Amplifier"
FriendlyNamePlural="Ordnance Amplifiers"
BriefSummary="Ordnance Amplifier combines our latest breakthroughs in beam technology-based propulsion and AI-assisted targeting systems to deliver payloads with unprecedented precision."
TacticalText="<Bullet/> Ordnance Amplifier is able to launch grenades with a substantially increased range relative to throwing.\n<Bullet/> Grants two Grenade-only slots."
AbilityDescName="ordnance launcher"


[IRI_KineticStrike X2AbilityTemplate]
LocFriendlyName="Kinetic Strike"
LocLongDescription="spaaaaarku puuuunchii."
LocHelpText="spaaaaarku puuuunchii."
LocFlyOverText="Kinetic Strike"

[IRI_KineticStrikeModule_CV X2WeaponTemplate]
FriendlyName="Kinetic Strike Module"
FriendlyNamePlural="Ordnance Amplifiers"
BriefSummary="Ordnance Amplifier combines our latest breakthroughs in beam technology-based propulsion and AI-assisted targeting systems to deliver payloads with unprecedented precision."
TacticalText="<Bullet/> Ordnance Amplifier is able to launch grenades with a substantially increased range relative to throwing.\n<Bullet/> Grants two Grenade-only slots."
AbilityDescName="ordnance launcher"